Revit 2027 API
NonContinuousRailStructure.IsValidNonContinuousRailProfile Method
 Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidNonContinuousRailProfile(
	ElementId profileId
)
Public Function IsValidNonContinuousRailProfile (
	profileId As ElementId
) As Boolean
public:
bool IsValidNonContinuousRailProfile(
	ElementId^ profileId
)
member IsValidNonContinuousRailProfile :
        profileId : ElementId -> bool
Parameters
profileId ElementId
 The profile Id to be checked.
Return Value
Boolean
 True if the ElementId refers to a valid NonContinuousRail profile, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
InvalidElementId is considered a valid NonContinuousRail profile (the default profile).
See Also
Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace